Revit 2027 API
BuiltInFailures.DesignOptionFailures.CannotPutELAInOption Property
 Electrical Load Areas must be in the Main Model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPutELAInOption { get; }
Public Shared ReadOnly Property CannotPutELAInOption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPutELAInOption {
	FailureDefinitionId^ get ();
}
static member CannotPutELAInOption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace